УТ.УчетЗадач/src/InformationRegisters/cbr_ПользовательскиеНастройки/cbr_ПользовательскиеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>cbr_ПользовательскиеНастройки</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.cbr_ВидыПользовательскихНастроек</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНастройки</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.cbr_ВидыПользовательскихНастроек</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.УчетЗадач/src/CommonModules/cbr_УведомленияПользователей/Module.bsl
#Область ПрограммныйИнтерфейс
// Отправляет уведомление с указанными параметрами выбранному пользователю
// Параметры:
//		Пользователь - СправочникСсылка.Пользователи,
//		ТекстУведомления - Строка,
//		СрокНапоминания - Дата,
//		ВремяУведомления - Дата,
//		СпособУстановкиВремениНапоминания - ПеречислениеСсылка.СпособыУстановкиВремениНапоминания,
//		ИнтервалВремениНапоминания - Число,
//		ПредметУведомления - ДокументСсылка.cbr_Задача,
//		Идентификатор - Строка
Процедура ОтправитьУведомлениеПользователю(Пользователь, ТекстУведомления, СрокНапоминания, ВремяУведомления,
	СпособУстановкиВремениНапоминания, ИнтервалВремениНапоминания = 600, ПредметУведомления = Неопределено,
	Идентификатор = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(cbr_ПользовательскиеНастройки.Значение, ЛОЖЬ) КАК Значение,
	|	cbr_ПользовательскиеНастройки.ВидНастройки
	|ИЗ
	|	РегистрСведений.cbr_ПользовательскиеНастройки КАК cbr_ПользовательскиеНастройки
	|ГДЕ
	|	cbr_ПользовательскиеНастройки.Пользователь = &Пользователь
	|	И cbr_ПользовательскиеНастройки.ВидНастройки В
	|	(ЗНАЧЕНИЕ(ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.База),
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.ЭлектроннаяПочта),
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.Битрикс),
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.Телеграм))";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидНастройки = ПредопределенноеЗначение(
			"ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.ЭлектроннаяПочта") И Выборка.Значение Тогда

		КонецЕсли;

		Если Выборка.ВидНастройки = ПредопределенноеЗначение(
			"ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.Телеграм") И Выборка.Значение Тогда
			ТекстУведомления = ДобавитьСсылкиНаПредметУведомленияКТекстуУведомления(ТекстУведомления, ПредметУведомления, Истина, Истина, Истина);	
			cbr_РаботаСTelegram.ОтправитьСообщениеПользователюПоСсылке(Пользователь,ТекстУведомления, ПредметУведомления);
		КонецЕсли;

		Если Выборка.ВидНастройки = ПредопределенноеЗначение(
			"ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.Битрикс") И Выборка.Значение Тогда

		КонецЕсли;

		Если Выборка.ВидНастройки = ПредопределенноеЗначение(
			"ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.База") И Выборка.Значение Тогда
			ПараметрыНапоминания = Новый Структура;

			ПараметрыНапоминания.Вставить("Пользователь", Пользователь);
			ПараметрыНапоминания.Вставить("Описание", ТекстУведомления);
			ПараметрыНапоминания.Вставить("ВремяСобытия", ВремяУведомления);
			ПараметрыНапоминания.Вставить("СрокНапоминания", СрокНапоминания);
			ПараметрыНапоминания.Вставить("Источник", ПредметУведомления);
			ПараметрыНапоминания.Вставить("СпособУстановкиВремениНапоминания", СпособУстановкиВремениНапоминания);
			ПараметрыНапоминания.Вставить("ИнтервалВремениНапоминания", ИнтервалВремениНапоминания);
			ПараметрыНапоминания.Вставить("Идентификатор", Идентификатор);

			НапоминанияПользователяСлужебный.ПодключитьНапоминание(ПараметрыНапоминания, Ложь, Ложь);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ДобавитьСсылкиНаПредметУведомленияКТекстуУведомления(ТекстУведомления, ПредметУведомления,
	ДобавитьПредставлениеДокумента = Ложь, ДобавитьНавигационнуюСсылку = Ложь, ДобавитьВнешнююСсылку = Ложь)
	Если ТекстУведомления = "" Или ПредметУведомления = Неопределено Тогда
		Возврат ТекстУведомления;
	КонецЕсли;

	РазделительДобавлен = Ложь;
	Разделитель = Символы.ПС + "..." + Символы.ПС;
	ПредставлениеСсылки = "";
	ВнешняяНавигационаяСсылка = "";
	НавигационаяСсылка = "";

	Если ДобавитьПредставлениеДокумента Тогда
		ПредставлениеСсылки = Строка(ПредметУведомления);

		Если Не РазделительДобавлен Тогда
			ТекстУведомления = ТекстУведомления + Разделитель;
			РазделительДобавлен = Истина;
		Иначе
			ТекстУведомления = ТекстУведомления + Символы.ПС;
		КонецЕсли;

		ТекстУведомления = ТекстУведомления + ПредставлениеСсылки;
	КонецЕсли;

	Если ДобавитьВнешнююСсылку Тогда
		ВнешняяНавигационаяСсылка = ПолучитьВнешнююНавигационнуюСсылку(ПредметУведомления);
		Если Не ВнешняяНавигационаяСсылка = ПредставлениеСсылки Тогда
			ВнешняяНавигационаяСсылка = "Внешняя навигационая ссылка - "+"""["+ВнешняяНавигационаяСсылка+"]""";
			
			Если Не РазделительДобавлен Тогда
				ТекстУведомления = ТекстУведомления + Разделитель;
				РазделительДобавлен = Истина;
			Иначе
				ТекстУведомления = ТекстУведомления + Символы.ПС;
			КонецЕсли;

			ТекстУведомления = ТекстУведомления + ВнешняяНавигационаяСсылка;
		КонецЕсли;
	КонецЕсли;

	Если ДобавитьНавигационнуюСсылку Тогда
		НавигационаяСсылка = ПолучитьНавигационнуюСсылку(ПредметУведомления);
		
		НавигационаяСсылка = "Навигационная ссылка - "+"""["+НавигационаяСсылка+"]""";
		
		Если Не РазделительДобавлен Тогда
			ТекстУведомления = ТекстУведомления + Разделитель;
			РазделительДобавлен = Истина;
		Иначе
			ТекстУведомления = ТекстУведомления + Символы.ПС;
		КонецЕсли;

		ТекстУведомления = ТекстУведомления + НавигационаяСсылка;
		
	КонецЕсли;
	
	Возврат ТекстУведомления;

КонецФункции
#КонецОбласти
